tests/test-node-helloworld2/ab-output-1329462616.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.236.10.145 (be patient)


Server Software:        
Server Hostname:        10.236.10.145
Server Port:            1337

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      10
Time taken for tests:   11.924 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      76000 bytes
HTML transferred:       12000 bytes
Requests per second:    83.86 [#/sec] (mean)
Time per request:       119.242 [ms] (mean)
Time per request:       11.924 [ms] (mean, across all concurrent requests)
Transfer rate:          6.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.5      4       8
Processing:    26  114  55.5    118     299
Waiting:       23  112  55.3    114     294
Total:         31  119  55.3    122     300

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    148
  75%    166
  80%    178
  90%    196
  95%    203
  98%    208
  99%    218
 100%    300 (longest request)